Masmiseim36/nxpSDK/boards/twrkv58f220m/bootloader_examples/tower_bootloader/pin_mux.h
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTE4 (number 7), SW3
  @{ */
#define BOOT_PIN_SW3_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOOT_PIN_SW3_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOOT_PIN_SW3_PIN 4U     /*!<@brief PORTE pin index: 4 */
                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBootPin(void);

/*! @name PORTB0 (number 81), J15[A43]/J31[7]/UART0_RX
  @{ */
#define UART0_POLLFORACTIVITY_RX_GPIO_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define UART0_POLLFORACTIVITY_RX_GPIO_PORT PORTB /*!<@brief PORT device name: PORTB */
#define UART0_POLLFORACTIVITY_RX_GPIO_PIN 0U     /*!<@brief PORTB pin index: 0 */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_PollForActivity(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART 0 receive data source select: UART0_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTB0 (number 81), J15[A43]/J31[7]/UART0_RX
  @{ */
#define UART0_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define UART0_RX_PIN 0U     /*!<@brief PORTB pin index: 0 */
                            /* @} */

/*! @name PORTB1 (number 82), J15[A44]/J31[5]/UART0_TX
  @{ */
#define UART0_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define UART0_TX_PIN 1U     /*!<@brief PORTB pin index: 1 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_InitPins(void);

/*! @name PORTB0 (number 81), J15[A43]/J31[7]/UART0_RX
  @{ */
#define UART0_RESTOREDEFAULT_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define UART0_RESTOREDEFAULT_RX_PIN 0U     /*!<@brief PORTB pin index: 0 */
                                           /* @} */

/*! @name PORTB1 (number 82), J15[A44]/J31[5]/UART0_TX
  @{ */
#define UART0_RESTOREDEFAULT_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define UART0_RESTOREDEFAULT_TX_PIN 1U     /*!<@brief PORTB pin index: 1 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_RestoreDefault(void);

/*! @name PORTB2 (number 83), J14[7]/ENET0_1588_TMR0
  @{ */
#define I2C0_SCL_PORT PORTB /*!<@brief PORT device name: PORTB */
#define I2C0_SCL_PIN 2U     /*!<@brief PORTB pin index: 2 */
                            /* @} */

/*! @name PORTB3 (number 84), J14[5]/ENET0_1588_TMR1
  @{ */
#define I2C0_SDA_PORT PORTB /*!<@brief PORT device name: PORTB */
#define I2C0_SDA_PIN 3U     /*!<@brief PORTB pin index: 3 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C0_InitPins(void);

/*! @name PORTB2 (number 83), J14[7]/ENET0_1588_TMR0
  @{ */
#define I2C0_RESTOREDEFAULT_SCL_PORT PORTB /*!<@brief PORT device name: PORTB */
#define I2C0_RESTOREDEFAULT_SCL_PIN 2U     /*!<@brief PORTB pin index: 2 */
                                           /* @} */

/*! @name PORTB3 (number 84), J14[5]/ENET0_1588_TMR1
  @{ */
#define I2C0_RESTOREDEFAULT_SDA_PORT PORTB /*!<@brief PORT device name: PORTB */
#define I2C0_RESTOREDEFAULT_SDA_PIN 3U     /*!<@brief PORTB pin index: 3 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C0_RestoreDefault(void);

/*! @name PORTE16 (number 18), J15[B46]/SPI0_PCS0
  @{ */
#define SPI0_PCS_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_PCS_PIN 16U    /*!<@brief PORTE pin index: 16 */
                            /* @} */

/*! @name PORTE17 (number 19), J15[B48]/SPI0_SCK
  @{ */
#define SPI0_SCK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_SCK_PIN 17U    /*!<@brief PORTE pin index: 17 */
                            /* @} */

/*! @name PORTE18 (number 20), J15[B45]/SPI0_SOUT
  @{ */
#define SPI0_SOUT_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_SOUT_PIN 18U    /*!<@brief PORTE pin index: 18 */
                             /* @} */

/*! @name PORTE19 (number 21), J15[B44]/SPI0_SIN
  @{ */
#define SPI0_SIN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_SIN_PIN 19U    /*!<@brief PORTE pin index: 19 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI0_InitPins(void);

/*! @name PORTE16 (number 18), J15[B46]/SPI0_PCS0
  @{ */
#define SPI0_RESTOREDEFAULT_PCS_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_RESTOREDEFAULT_PCS_PIN 16U    /*!<@brief PORTE pin index: 16 */
                                           /* @} */

/*! @name PORTE17 (number 19), J15[B48]/SPI0_SCK
  @{ */
#define SPI0_RESTOREDEFAULT_SCK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_RESTOREDEFAULT_SCK_PIN 17U    /*!<@brief PORTE pin index: 17 */
                                           /* @} */

/*! @name PORTE18 (number 20), J15[B45]/SPI0_SOUT
  @{ */
#define SPI0_RESTOREDEFAULT_SOUT_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_RESTOREDEFAULT_SOUT_PIN 18U    /*!<@brief PORTE pin index: 18 */
                                            /* @} */

/*! @name PORTE19 (number 21), J15[B44]/SPI0_SIN
  @{ */
#define SPI0_RESTOREDEFAULT_SIN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_RESTOREDEFAULT_SIN_PIN 19U    /*!<@brief PORTE pin index: 19 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI0_RestoreDefault(void);

/*! @name PORTB17 (number 96), J15[B67]/FB_AD16
  @{ */
#define CAN0_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define CAN0_RX_PIN 17U    /*!<@brief PORTB pin index: 17 */
                           /* @} */

/*! @name PORTB16 (number 95), J15[B68]/FB_AD17
  @{ */
#define CAN0_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define CAN0_TX_PIN 16U    /*!<@brief PORTB pin index: 16 */
                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void CAN0_InitPins(void);

/*! @name PORTB17 (number 96), J15[B67]/FB_AD16
  @{ */
#define CAN0_RESTOREDEFAULT_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define CAN0_RESTOREDEFAULT_RX_PIN 17U    /*!<@brief PORTB pin index: 17 */
                                          /* @} */

/*! @name PORTB16 (number 95), J15[B68]/FB_AD17
  @{ */
#define CAN0_RESTOREDEFAULT_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define CAN0_RESTOREDEFAULT_TX_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void CAN0_RestoreDefault(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
